stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_mrsubg.h
/**
  ******************************************************************************
  * @file    stm32wl3x_ll_mrsubg.h
  * @author  GPM Application Team
  * @brief   Header file of MRSUBG LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

  /* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32WL3x_LL_MRSUBG_H
#define STM32WL3x_LL_MRSUBG_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32wl3x.h"
#include "stm32wl3x_ll_utils.h"

/** @addtogroup STM32WL3x_LL_Driver
  * @{
  */

/** @defgroup MRSUBG_LL MRSUBG
  * @{
  */

/** @defgroup MRSUBG_LL_Private_Constants MRSUBG Private Constants
  * @{
  */
#if defined(IS_169MHZ)
  /* WL33xA */
  #define HIGH_BAND_FACTOR      8	/*!< Band select factor for high band. Factor B in the equation of the user manual */
  #define LOW_BAND_FACTOR       20	/*!< Band select factor for middle band. Factor B in the equation of the user manual */

  #define LOW_BAND_LOWER_LIMIT		159200000   /*!< Lower limit of the low band */
  #define LOW_BAND_UPPER_LIMIT		185600000   /*!< Upper limit of the low band */
  #define HIGH_BAND_LOWER_LIMIT		398000000   /*!< Lower limit of the high band */
  #define HIGH_BAND_UPPER_LIMIT		464000000   /*!< Upper limit of the high band */
#else
  /* WL33x */
  #define HIGH_BAND_FACTOR	4	/*!< Band select factor for high band. Factor B in the equation of the user manual */
  #define LOW_BAND_FACTOR	8	/*!< Band select factor for middle band. Factor B in the equation of the user manual */

#define LOW_BAND_LOWER_LIMIT		413000000   /*!< Lower limit of the low band */
#define LOW_BAND_UPPER_LIMIT		479000000   /*!< Upper limit of the low band */
#define HIGH_BAND_LOWER_LIMIT		826000000   /*!< Lower limit of the high band */
#define HIGH_BAND_UPPER_LIMIT		958000000   /*!< Upper limit of the high band */
#endif

#define MINIMUM_DATARATE		100	/*!< Minimum datarate supported by STM32WL3 100 bps */
#define MAXIMUM_DATARATE		300000  /*!< Maximum datarate supported by STM32WL3 300 ksps (600 kbps) */

#define SEQ_MASK_NEVER_MATCH MR_SUBG_GLOB_STATUS_RFSEQ_IRQ_STATUS_SEQ_F /* If we use SEQ_F as the only flag bit to match on, then a match can never occur because SEQ_F is only set when the sequencer terminates. */
#define SEQ_MASK_ALWAYS_MATCH 0x00000000 /* The Sequencer automatically matches a null mask */

/**
  * @}
  */

/** @defgroup MRSUBG_LL_Exported_Macros MRSUBG Exported Macros
* @{
  */

#define IS_PREAMBLE_LEN(VAL)	        (VAL<=2046)
#define IS_POSTAMBLE_LEN(VAL)	        (VAL<=126)
#define IS_SYNC_LEN(VAL)                (VAL<=32)
#define IS_FRAME_LEN(VAL)               (VAL>=2) && (VAL<=2047)
#define IS_PREAMBLE_15_4G_LEN(VAL)      (((VAL)>=4) && ((VAL)<=64))

#define IS_MODULATION_15_4G(MOD) (((MOD) == MOD_2FSK) || ((MOD) == MOD_4FSK))

#define IS_FCS_TYPE(TYPE)        (((TYPE) == FCS_16BIT) || \
                                 ((TYPE) == FCS_32BIT))

#define IS_FEC_TYPE(TYPE)       (((TYPE) == FEC_15_4_G_NONE) || \
                                ((TYPE) == FEC_15_4_G_NRNSC) || \
                                ((TYPE) == FEC_15_4_G_RSC) || \
                                ((TYPE) == FEC_15_4_G_RSC_Interleaving))


#define IS_WMBUS_SUBMODE(MODE)   (((MODE) == WMBUS_SUBMODE_S1_S2_LONG_HEADER) || \
                                 ((MODE) == WMBUS_SUBMODE_NOT_CONFIGURED) || \
                                 ((MODE) == WMBUS_SUBMODE_S1_M_S2_T2_OTHER_TO_METER) || \
                                 ((MODE) == WMBUS_SUBMODE_T1_T2_METER_TO_OTHER) || \
                                 ((MODE) == WMBUS_SUBMODE_R2_SHORT_HEADER))

/** @brief Macro that checks if SELECTION is a MRSubG_WhiteningBeforeFECType */
#define IS_WHITEFEC_SELECTION(SELECTION) (((SELECTION) == FEC_THEN_WHITENING) || ((SELECTION) == WHITENING_THEN_FEC))

#define PREAMBLE_BYTE(v)        (4*v)
#define SYNC_BYTE(v)            ((8*v)-1)
/**
  * @}
  */


/** @defgroup MRSUBG_LL_Exported_Types MRSUBG Exported Types
  * @{
  */
/**
* @brief  STM32WL3 MRSUBG PA modes
*/
typedef enum{
  PA_LEGACY     = 0x00, /* legacy mode */
  PA_FIR        = 0x01, /* FIR active (to be used in ASK/OOK modulation only) */
  PA_DIRECT     = 0x02  /* Direct mode */
} MRSubG_PAMode;

/**
* @brief  STM32WL3 PA drive modes
*/
typedef enum{
  PA_DRV_TX         = 0x01, /* up to 10dBm */
  PA_DRV_TX_HP      = 0x02, /* up to 14dBm */
  PA_DRV_TX_TX_HP   = 0x03  /* up to 20dBm */
} MRSubG_PA_DRVMode;

/**
  * @brief  STM32WL3 Commands codes enumeration
  */
typedef enum
{
  CMD_NOP               = ((uint8_t)(0x00)),                 /* No action. This 'no' command can be requested at any time, whatever the on-going command or in IDLE */
  CMD_TX                = ((uint8_t)(0x01)),			/* Start a TX sequence */
  CMD_RX                = ((uint8_t)(0x02)),		        /* Start a RX sequence */
  CMD_LOCKRX            = ((uint8_t)(0x03)),               /* Start a RF sequence up to PLL locked based on RX frequency */
  CMD_LOCKTX            = ((uint8_t)(0x04)),               /* Start a RF sequence up to PLL locked based on TX frequency */
  CMD_SABORT            = ((uint8_t)(0x05)),               /* Stop any on-going RX/TX/LOCKRX/LOCKTX command */
  CMD_CALIB_SAFEASK     = ((uint8_t)(0x0A)),        /* Launch a PA Safe-ASK calibration to get the max safe PA code to be used */
  CMD_RELOAD_RX_TIMER   = ((uint8_t)(0x06)),      /* Reload with a new timeout and new stop conditions and restart the RX Timer */
  CMD_CALIB_AGC         = ((uint8_t)(0x0B))         /* Start needed HW features to run an AGC_ATTEN trim sequence at SW level */
} MRSubGCmd;

/**
  * @brief  STM32WL3 MRSUBG FSM state enumaration
  */
typedef enum
{
  STATE_IDLE = 0x00,
  STATE_ENA_RF_REG = 0x01,
  STATE_WAIT_ACTIVE2 = 0x02,
  STATE_ACTIVE2 = 0x03,
  STATE_ENA_CURR = 0x04,
  STATE_SYNTH_SETUP = 0x05,
  STATE_CALIB_VCO = 0x06,
  STATE_LOCKRXTX = 0x07,
  STATE_LOCKONTX = 0x08,
  STATE_EN_PA = 0x09,
  STATE_TX = 0x0A,
  STATE_PA_DWN_ANA = 0x0B,
  STATE_END_TX = 0x0C,
  STATE_LOCKONRX = 0x0D,
  STATE_EN_RX = 0x0E,
  STATE_EN_LNA = 0x0F,
  STATE_RX = 0x10,
  STATE_END_RX = 0x11,
  STATE_SYNTH_PWDN = 0x12
} MRSubGFSMState;

/**
* @brief  BT Values for GFSK
*/
typedef enum {
  BT_1 = 0,
  BT_05 = 1
} MRSubG_BTSelect;

/**
 * @brief  STM32WL3 Transmission modes
 */
typedef enum {
  ISI_EQ_DISABLED = 0x00,
  ISI_EQ_SP = 0x01,
  ISI_EQ_DP = 0x02
} MRSubG_ISIEQMode;

/**
 * @brief  STM32WL3 Transmission modes
 */
typedef enum{
  TX_NORMAL             = 0x00, /* Only payload is provided through RAM buffers Rest of the frame built from configuration registers (PREAMBLE, SYNC, CRC...). */
  TX_DIRECT_BUFFERS     = 0x01, /* Full bit stream (including PREAMBLE, SYNC, CRC...) to be provided through RAM buffers. */
  TX_DIRECT_GPIO        = 0x02, /* Full bit stream (including PREAMBLE, SYNC, CRC...) to be provided serially through the TX DATA GPIO. */
  TX_PN                 = 0x03  /* Internal PN generator send a polynomial bit stream on the antenna. */
} MRSubGTXMode;

/**
 * @brief  STM32WL3 Reception modes
 */
typedef enum{
  RX_NORMAL             = 0x00, /* Only payload is stored into the RAM buffers. CRC and packet length are readable in dedicated status registers */
  RX_DIRECT_BUFFERS     = 0x01, /* Full bit stream is stored into the RAM buffers. */
  RX_DIRECT_GPIO        = 0x02, /* Full bit stream is provided serially through the RX DATA GPIO */
  RX_IQ_SAMPLING        = 0x03, /* Raw I/Q sampling taken at the output of the Channel filter inside the demodulator are stored in RAM. */
  RX_FREQDETEC_SAMPLING = 0x04, /* Raw data taken at the output of the frequency detector inside the demodulator (detection of the instantaneous frequency changes) are stored in RAM. */
  RX_SOFTBIT_SAMPLING   = 0x05  /* Raw data taken at the output of the post-filter inside the demodulator (soft bits before the 0/1 detection) are stored in RAM. */
} MRSubGRXMode;

/**
  * @brief  STM32WL3 preamble pattern enumeration
  */
typedef enum
{
  PRE_SEQ_0101 = 0x00, /* Suitable for 2-(G)FSK and ASK/OOK */
  PRE_SEQ_1010 = 0x01, /* Suitable for 2-(G)FSK and ASK/OOK */
  PRE_SEQ_0011 = 0x02, /* Suitable for 2-(G)FSK and ASK/OOK (not recommended - not the most convenient for the receiver) */
  PRE_SEQ_1100 = 0x03, /* Suitable for 2-(G)FSK and ASK/OOK (not recommended - not the most convenient for the receiver) */
  PRE_SEQ_0111 = 0x00, /* Suitable for 4-(G)FSK */
  PRE_SEQ_0010 = 0x01, /* Suitable for 4-(G)FSK */
  PRE_SEQ_1101 = 0x02, /* Suitable for 4-(G)FSK */
  PRE_SEQ_1000 = 0x03  /* Suitable for 4-(G)FSK */
} MRSubG_PreambleSeq;

/**
  * @brief  STM32WL3 preamble pattern enumeration
  */
typedef enum
{
  POST_SEQ_0101 = 0x00, /* 010101... */
  POST_SEQ_1010 = 0x01, /* 101010... */
  POST_SEQ_OTHER = 0x02  /* depends on last payload/CRC bit. If 0: 101010... - If 1: 010101... */
} MRSubG_PostambleSeq;

/**
* @brief  STM32WL3 packet coding options
*/
typedef enum
{
  CODING_NONE = 0x00,		/* None */
  CODING_FEC = 0x01,		/* FEC in TX / Viterbi in RX */
  CODING_3o6 = 0x02,		/* 3of6 coding */
  CODING_MANCHESTER = 0x03	/* Manchester coding */
} MRSubG_PcktCoding;

/**
* @brief  Whitening before FEC feature
*/
typedef enum
{
  FEC_THEN_WHITENING    = 0,
  WHITENING_THEN_FEC    = 1
} MRSubG_WhiteningBeforeFECType;

/**
 * @brief Manchester encoding polarity.
 * 	0: "0" is encoded with "01" and "1" is encoded with "10"
 *	1: "0" is encoded with "10" and "1" is encoded with "01"
 */
typedef enum
{
  MANCHESTER_TYPE0 = 0,
  MANCHESTER_TYPE1 = 1
} MRSubG_ManchesterPolarity;

/**
 * @brief  CRC length in bytes enumeration.
 */
typedef enum {
  PKT_NO_CRC               = 0x00, /*!< No CRC                              */
  PKT_CRC_MODE_8BITS       = 0x01, /*!< CRC length 8 bits  - poly: 0x07     */
  PKT_CRC_MODE_16BITS_1    = 0x02, /*!< CRC length 16 bits - poly: 0x8005   */
  PKT_CRC_MODE_16BITS_2    = 0x03, /*!< CRC length 16 bits - poly: 0x1021   */
  FCS_16BIT 	           = 0x03, /*!< CRC length 16 bits - poly: 0x1021   */
  PKT_CRC_MODE_24BITS      = 0x04, /*!< CRC length 24 bits - poly: 0x864CFB */
  PKT_CRC_MODE_32BITS      = 0x05, /*!< CRC length 32 bits - poly: 0x04C11DB7 */
  FCS_32BIT 	           = 0x05, /*!< CRC length 32 bits - poly: 0x04C11DB7 */
} MRSubG_PcktCrcMode;

/**
 * @brief Fixed or Variable length mode.
 * 0: FIXED length mode (no LENGTH field added in the frame in TX and no decode in RX)
 * 1: VARIABLE length mode (LENGTH field put in the frame in TX and decoded in RX)
 */
typedef enum
{
  FIXED 	= 0,
  VARIABLE 	= !FIXED
} MRSubG_LengthMode;

/**
 * @brief 1 or 2 bytes length width.
 * 0: LENGTH bit field is defined on 1 byte
 * 1: LENGTH bit field is defined on 2 bytes
 */
typedef enum
{
  BYTE_LEN_1 	= 0,
  BYTES_LEN_2 	= 1
} MRSubG_LenWidthhMode;

/**
* @brief  STM32WL3 Frequency Band IDs
*/
typedef enum{
  FQCY_STANDARD   = 0x00, /* Standard band */
  FQCY_169MHZ     = 0x03  /* 169 MHz band */
} MRSubG_Frequency_ID;

/**
 * @brief Sequencer flag bits
 */
typedef enum {
  /* Indicating if the low power mode was allowed during the wait interval since last SeqAction execution */
  SEQ_FLAG_SLEEPENABLE = 0x01,

  /* Enable/disable a force reload of the Static registers even if no reset occurs since last reload */
  SEQ_FLAG_FORCERELOAD = 0x02,

  /* Clear the internal seq_event_status bus before to start the SeqAction */
  SEQ_FLAG_CLEAREVENTS = 0x04

} MRSubG_Sequencer_Flags;

typedef struct MRSubG_Sequencer_ActionConfiguration MRSubG_Sequencer_ActionConfiguration;

/**
 * @brief Sequencer ActionConfiguration RAM table structure
 */
struct MRSubG_Sequencer_ActionConfiguration {
  /*
   * NextAction1
   */
  /** Pointer to NextAction1, executed upon NextAction1Mask match. */
  MRSubG_Sequencer_ActionConfiguration* NextAction1Ptr;

