stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_mrsubg.h
  /** Time to wait before NextAction1 execution, in interpolated absolute time units. */
  uint32_t NextAction1Interval;

  /** Bitmask for NextAction1 - if SubGHz status register against matches against this mask, NextAction1 is performed next. */
  uint32_t NextAction1Mask;

  /** Configuration flags (ForceClearEvents, ForceReload and SleepEn) for sequencer hardware, set if NextAction1 is performed next. */
  uint32_t NextAction1Ctrl;

  /* NextAction2 */
  /** Pointer to NextAction2, executed upon NextAction1Mask match. */
  MRSubG_Sequencer_ActionConfiguration* NextAction2Ptr;

  /** Time to wait before NextAction2 execution, in interpolated absolute time units. */
  uint32_t NextAction2Interval;

  /** Bitmask for NextAction2 - if SubGHz status register against matches against this mask, NextAction2 is performed next. */
  uint32_t NextAction2Mask;

  /** Configuration flags (ForceClearEvents, ForceReload and SleepEn) for sequencer hardware, set if NextAction2 is performed next. */
  uint32_t NextAction2Ctrl;

  /** Time to wait for either NextAction1Mask or NextAction2Mask match before aborting, in interpolated absolute time units.
   *  Set to 0 for no timeout. */
  uint32_t ActionTimeout;

  /** Dynamic Register Configuration, applied for the current action. */
  MR_SUBG_GLOB_DYNAMIC_TypeDef DynamicConfigReg;
};

/**
 * @brief Sequencer GlobalConfiguration RAM table structure
 */
typedef struct {
  /** Pointer to first ActionConfiguration */
  volatile MRSubG_Sequencer_ActionConfiguration* ActionConfigPtr;

  /** Configuration flags (ForceClearEvents, ForceReload and SleepEn) for sequencer hardware. */
  volatile uint32_t Flags;

  /** SubGHz static configuration registers. */
  MR_SUBG_GLOB_STATIC_TypeDef StaticConfigReg;
} MRSubG_Sequencer_GlobalConfiguration;

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup MRSUBG_LL_Exported_Functions MRSUBG Exported Functions
  * @{
  */

/**
* @brief  Set the PA Mode.
* @param  paMode the PA Mode.
* @retval None.
*/
__STATIC_INLINE void LL_MRSubG_SetPAMode(MRSubG_PAMode paMode){
  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PA_CONFIG, MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_MODE, paMode);
}

/**
* @brief  Set the PA Drive Mode.
* @param  paDrvMode the PA Drive Mode.
* @retval None.
*/
__STATIC_INLINE void LL_MRSubG_SetPADriveMode(MRSubG_PA_DRVMode paDrvMode){
  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PA_CONFIG, MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_DRV_MODE, paDrvMode);
}

/**
* @brief  Get the PA Drive Mode.
* @retval The PA Drive Mode.
*/
__STATIC_INLINE MRSubG_PA_DRVMode LL_MRSubG_GetPADriveMode(void){
  return (MRSubG_PA_DRVMode) READ_REG_FIELD(MR_SUBG_GLOB_STATIC->PA_CONFIG, MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_DRV_MODE);
}

/**
* @brief  Force the SYNC word to be formatted as 2-(G)FSK bit mapping instead of 4-(G)FSK.
* @param  forceSync DISABLE: the SYNC word is treated in 4-(G)FSK mapping as the rest of the frame.
*                   ENABLE: the SYNC word of the frame is mapped as follows
*                       '1' is mapped to +Fdev; '0' is mapped to -Fdev for constellation mapping = 0 and 1
*                       '1' is mapped to -Fdev; '0' is mapped to +Fdev for constellation mapping = 2 and 3
* @retval None.
*/
__STATIC_INLINE void LL_MRSubG_Force2FSKSync(FunctionalState forceSync){
  if(forceSync == ENABLE)
    SET_BIT(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_FORCE_2FSK_SYNC_MODE);
  else
    CLEAR_BIT(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_FORCE_2FSK_SYNC_MODE);
}

/**
 * @brief  Set the CONST_MAP configuration for
 * 2-(G)FSK or 4-(G)FSK
 * @param  nConMap the configuration.
 * @retval None.
 */
__STATIC_INLINE void LL_MRSubG_SetConstellationMapping(uint8_t nConMap){
  MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->MOD0_CONFIG, MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_CONST_MAP, nConMap);
}

/**
 * @brief Invert bit to symbol mapping for 4(G)FSK
 * @param  xNewState new state for FOUR_FSK_SYM_SWAP bit
 * @retval None.
 */
__STATIC_INLINE void LL_MRSubG_SwapSymbolMapping(FunctionalState xNewState){
  if(xNewState == ENABLE)
    SET_BIT(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_FOUR_FSK_SYM_SWAP);
  else
    CLEAR_BIT(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_FOUR_FSK_SYM_SWAP);
}

/**
 * @brief Select BT value for GFSK
 * @param  bSel BT value
 * 	This value is type of @ref MRSubG_BTSelect.
 * @retval None.
 */
__STATIC_INLINE void LL_MRSubG_SetBTSel(MRSubG_BTSelect bSel){
  if(bSel == BT_05)
    SET_BIT(MR_SUBG_GLOB_DYNAMIC->MOD0_CONFIG, MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_BT_SEL);
  else
    CLEAR_BIT(MR_SUBG_GLOB_DYNAMIC->MOD0_CONFIG, MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_BT_SEL);
}

/**
 * @brief Select BT value for GFSK
 * @param  xNewState BT value
 * 	This value is type of @ref MRSubG_BTSelect.
 * @retval None.
 */
__STATIC_INLINE void LL_MRSubG_SetFrequencyInterpolator(FunctionalState xNewState){
  if(xNewState == ENABLE)
    SET_BIT(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_MOD_INTERP_EN);
  else
    CLEAR_BIT(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_MOD_INTERP_EN);
}

/**
 * @brief Set the ISI cancellation equalizer
 * @param  isiEq the Equalizer value
 * 	This value is type of @ref MRSubG_ISIEQMode.
 * @retval None.
 */
__STATIC_INLINE void LL_MRSubG_SetISIEqualizer(MRSubG_ISIEQMode isiEq){
  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->AS_QI_CTRL, MR_SUBG_GLOB_STATIC_AS_QI_CTRL_AS_EQU_CTRL, isiEq);
}

/**
 * @brief  Send a specific command to the STM32WL3.
 * @param  xCommandCode code of the command to send.
           This parameter can be any value of @ref MRSubGCmd.
 * @retval None.
 */
__STATIC_INLINE void LL_MRSubG_StrobeCommand(MRSubGCmd xCommandCode) {
  MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->COMMAND, MR_SUBG_GLOB_DYNAMIC_COMMAND_COMMAND_ID, xCommandCode);
}

/**
 * @brief  Set the TX_MODE field of the PCKT_CTRL register.
 * @param  txMode The TX Mode.
 *	    This parameter can be any value of @ref MRSubGTXMode.
 * @retval None.
 */
__STATIC_INLINE void LL_MRSubG_SetTXMode(MRSubGTXMode txMode){
  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_TX_MODE, txMode);
}

/**
 * @brief  Sets the RX_MODE field of PCKT_CTRL register.
 * @param  rxMode the rx mode.
 *	    This parameter can be any value of @ref MRSubGRXMode.
 * @retval None.
 */
__STATIC_INLINE void LL_MRSubG_SetRXMode(MRSubGRXMode rxMode){
  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_RX_MODE, rxMode);
}

/**
* @brief  Sets the channel number.
* @param  cChannel the channel number.
* @retval None.
*/
__STATIC_INLINE void LL_MRSubG_SetChannel(uint8_t cChannel){
  MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->ADDITIONAL_CTRL, MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_NUM, cChannel);
}

/**
* @brief  Returns the actual channel number.
* @retval uint8_t Actual channel number.
*/
__STATIC_INLINE uint8_t LL_MRSubG_GetChannel(void){
  return READ_REG(MR_SUBG_GLOB_DYNAMIC->ADDITIONAL_CTRL) & MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_NUM;
}

/**
* @brief  Set the channel spacing factor in channel space register.
*         The channel spacing is From ~732 Hz to ~187 kHz in 732 Hz steps
* @param  lChannelSpace the channel spacing expressed in Hz.
* @retval None.
*/
__STATIC_INLINE void LL_MRSubG_SetChannelSpace(uint8_t lChannelSpace){
  MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->ADDITIONAL_CTRL, MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_SPACING, lChannelSpace);
}

/**
* @brief  Return the channel space register.
* @retval uint8_t Channel spacing.
*/
__STATIC_INLINE uint8_t LL_MRSubG_GetChannelSpace(void){
  return READ_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->ADDITIONAL_CTRL, MR_SUBG_GLOB_DYNAMIC_ADDITIONAL_CTRL_CH_SPACING);
}

/**
* @brief  Set the PA_DEGEN_ON bit. This will Enable/Disable a degeneration mode, which introduces a pre-distortion to linearize the power control curve.
* @param  xNewState enable (ENABLE) to enable or disable (DISABLE) the degeneration.
* @retval None.
*/
__STATIC_INLINE void LL_MRSubG_SetPADegen(FunctionalState xNewState) {
  if(xNewState == ENABLE) {
    SET_BIT(MR_SUBG_RADIO->PA_REG, MR_SUBG_RADIO_PA_REG_PA_DEGEN_ON);
  } else {
    CLEAR_BIT(MR_SUBG_RADIO->PA_REG, MR_SUBG_RADIO_PA_REG_PA_DEGEN_ON);
  }
}

/**
* @brief  Returns the actual PA_LEVEL_MAX_INDEX.
* @retval uint8_t Actual PA_LEVEL_MAX_INDEX. This parameter will be in the range [0:7].
*/
__STATIC_INLINE uint8_t LL_MRSubG_GetPALevelMaxIndex(void){
  return READ_REG_FIELD(MR_SUBG_GLOB_STATIC->PA_CONFIG, MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_LEVEL_MAX_INDEX);
}

/**
* @brief  Sets a specific PA_LEVEL_MAX_INDEX.
* @param  cIndex PA_LEVEL_MAX_INDEX to set.
* @retval None
*/
__STATIC_INLINE void LL_MRSubG_SetPALevelMaxIndex(uint8_t cIndex){
  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PA_CONFIG, MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_LEVEL_MAX_INDEX, cIndex);
}

/**
 * @brief  Set the Almost Empty threshold for the Databuffer. When the number of elements in Databuffer reaches this value an interrupt can can be generated.
 * @param  cThrTx: almost empty threshold.
 * @retval None.
 */
__STATIC_INLINE void LL_MRSubG_SetAlmostEmptyThresholdTx(uint16_t cThrTx){
  /* Writes the Almost Empty threshold for Tx in the corresponding register */
  MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->DATABUFFER_THR, MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_TX_ALMOST_EMPTY_THR, cThrTx);
}

/**
 * @brief  Set the almost full threshold for the Databuffer. When the number of elements in Databuffer reaches this value an interrupt can be generated.
 * @param  cThrRx almost full threshold.
 * @retval None.
 */
__STATIC_INLINE void LL_MRSubG_SetAlmostFullThresholdRx(uint16_t cThrRx){
  /* Writes the Almost Full threshold for Tx in the corresponding register */
  MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->DATABUFFER_THR, MR_SUBG_GLOB_DYNAMIC_DATABUFFER_THR_RX_ALMOST_FULL_THR, cThrRx);
}

/**
 * @brief  Return the RADIO FSM State.
 * @retval Value of RADIO_FSM_STATE register
 */
__STATIC_INLINE MRSubGFSMState LL_MRSubG_GetRadioFSMState(void){
  return (MRSubGFSMState)(READ_REG_FIELD(MR_SUBG_GLOB_STATUS->RADIO_FSM_INFO, MR_SUBG_GLOB_STATUS_RADIO_FSM_INFO_RADIO_FSM_STATE));
}

/**
 * @brief  Set the PREAMBLE field Length.
 * @param  cPreambleLength length of PREAMBLE field in pairs of bits (0 to 2046 bits).
 * @retval None.
 */
__STATIC_INLINE void LL_MRSubG_SetPreambleLength(uint16_t cPreambleLength){
  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_LENGTH, cPreambleLength);
}

/**
 * @brief  Return the PREAMBLE field Length.
 * @retval uint16_t Preamble field length in in pairs of bits (0 to 2046 bits).
 */
__STATIC_INLINE uint16_t LL_MRSubG_GetPreambleLength(void){
  return READ_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_LENGTH);
}

/**
 * @brief  Set the PREAMBLE pattern to be applied.
 * @param  cPreambleSeq the pattern to apply
 * @retval None.
 */
__STATIC_INLINE void LL_MRSubG_SetPreambleSeq(MRSubG_PreambleSeq cPreambleSeq){
  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_SEQ, (uint8_t)cPreambleSeq);
}

/**
 * @brief  Return the PREAMBLE pattern.
 * @retval MRSubG_PreambleSeq Preamble pattern
 */
__STATIC_INLINE MRSubG_PreambleSeq LL_MRSubG_GetPreambleSeq(void){
  return (MRSubG_PreambleSeq)(READ_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_PREAMBLE_SEQ));
}

/**
 * @brief  Set the POSTAMBLE field Length.
 * @param  cPostambleLength length of POSTAMBLE field in pairs of bits (0 to 126 bits).
 * @retval None.
 */
__STATIC_INLINE void LL_MRSubG_SetPostambleLength(uint16_t cPostambleLength){
  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_LENGTH, cPostambleLength);
}

/**
 * @brief  Return the POSTAMBLE field Length.
 * @retval uint16_t Postamble field length in in pairs of bits (0 to 126 bits).
 */
__STATIC_INLINE uint16_t LL_MRSubG_GetPostambleLength(void){
  return READ_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_LENGTH);
}

/**
 * @brief  Set the POSTAMBLE pattern to be applied.
 * @param  cPostambleSeq the pattern to apply
 * @retval None.
 */
__STATIC_INLINE void LL_MRSubG_SetPostamblSeq(MRSubG_PostambleSeq cPostambleSeq){
  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_SEQ, (uint8_t)cPostambleSeq);
}

/**
 * @brief  Return the POSTAMBLE pattern.
 * @retval MRSubG_PostambleSeq Postamble pattern
 */
__STATIC_INLINE MRSubG_PostambleSeq LL_MRSubG_GetPostambleSeq(void){
  return (MRSubG_PostambleSeq)(READ_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_POSTAMBLE_SEQ));
}

/**
 * @brief  Set the SYNC_PRESENT bit.
 * @param  cSyncPresent the enable/disable value for the bit
 * @retval None.
 */
__STATIC_INLINE void LL_MRSubG_SetSyncPresent(FunctionalState cSyncPresent){
  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SYNC_PRESENT, cSyncPresent);
}

/**
 * @brief  Get the SYNC_PRESENT bit.
 * @retval The enable/disable value for the bit.
 */
__STATIC_INLINE FunctionalState LL_MRSubG_GetSyncPresent(void){
  return (FunctionalState)(READ_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SYNC_PRESENT));
}

/**
 * @brief  Set the SECONDARY_SYNC_SEL bit.
	     In TX mode: this bit selects which synchro word is sent on the frame between SYNC and SEC_SYNC
	     In RX mode: it enables the detection of SEC_SYNC in parallel of SYNC word.
 * @param  cSecondarySync the enable/disable value for the bit
 * @retval None.
 */
__STATIC_INLINE void LL_MRSubG_SetSecondarySync(FunctionalState cSecondarySync){
  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SECONDARY_SYNC_SEL, cSecondarySync);
}

/**
 * @brief  Get the SECONDARY_SYNC_SEL bit.
 * @retval The enable/disable value for the bit.
 */
__STATIC_INLINE FunctionalState LL_MRSubG_GetSecondarySync(void){
  return (FunctionalState)(READ_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SECONDARY_SYNC_SEL));
}

/**
 * @brief  Set the SYNC field Length.
 * @param  cSyncLength length of SYNC field in bits.
 * @retval None.
 */
__STATIC_INLINE void LL_MRSubG_SetSyncLength(uint8_t cSyncLength){
  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SYNC_LEN, cSyncLength);
}

/**
 * @brief  Return the SYNC field Length.
 * @retval uint8_t Sync field length in bits.
 */
__STATIC_INLINE uint8_t LL_MRSubG_GetSyncLength(void){
  return READ_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_SYNC_LEN);
}

/**
* @brief  Set the SYNC word.
* @param  lSyncWord SYNC word given as a 32 bits aligned word.
* @retval None.
*/
__STATIC_INLINE void LL_MRSubG_SetSyncWord(uint32_t lSyncWord){
  WRITE_REG(MR_SUBG_GLOB_STATIC->SYNC, lSyncWord);
}

/**
* @brief  Get the SYNC word.
* @retval The Sync word.
*/
__STATIC_INLINE uint32_t LL_MRSubG_GetSyncWord(void){
   return READ_REG(MR_SUBG_GLOB_STATIC->SYNC);
}


/**
* @brief  Set the SEC_SYNC word.
* @param  lSecSyncWord SEC_SYNC word given as a 32 bits aligned word.
* @retval None.
*/
__STATIC_INLINE void LL_MRSubG_SetSecondarySyncWord(uint32_t lSecSyncWord){
  WRITE_REG(MR_SUBG_GLOB_STATIC->SEC_SYNC, lSecSyncWord);
}

/**
* @brief  Get the SEC_SYNC word.
* @retval The Secondary Sync word.
*/
__STATIC_INLINE uint32_t LL_MRSubG_GetSecondarySyncWord(void){
   return READ_REG(MR_SUBG_GLOB_STATIC->SEC_SYNC);
}

/**
 * @brief  Enable or Disable WHITENING for STM32WL3 packets.
 * @param  xNewState new state for WHITENING mode.
 *         This parameter can be S_ENABLE or S_DISABLE.
 * @retval None.
 */
__STATIC_INLINE void LL_MRSubG_PacketHandlerWhitening(FunctionalState xNewState){
  if(xNewState == ENABLE)
    SET_BIT(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_EN);
  else
    CLEAR_BIT(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_EN);
}

/**
 * @brief  Enable or Disable BYTE_SWAP for STM32WL3 packets.
 * @param  xNewState new state for BYTE_SWAP mode.
 *         This parameter can be S_ENABLE or S_DISABLE.
 * @retval None.
 */
__STATIC_INLINE void LL_MRSubG_PacketHandlerByteSwap(FunctionalState xNewState){
  if(xNewState == ENABLE)
    SET_BIT(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_BYTE_SWAP);
  else
    CLEAR_BIT(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_BYTE_SWAP);
}

/**
 * @brief  Set the Fec and Whitening order
 * @param  xWhitFecOrder new Whitening/FEC order.
 * @retval None.
 */
__STATIC_INLINE void LL_MRSubG_PacketHandlerWhiteningFecOrder(MRSubG_WhiteningBeforeFECType xWhitFecOrder){
  if(xWhitFecOrder == WHITENING_THEN_FEC)
    SET_BIT(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_BF_FEC);
  else
    CLEAR_BIT(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_BF_FEC);
}

/**
 * @brief  Set the Whitening initialization value
 * @param  whit_init Whitening initialization value.
 *         In 802.15.4 standard, this initialization seed must be programmed to 0x1FF.
 * @retval None.
 */
__STATIC_INLINE void LL_MRSubG_PacketHandlerSetWhiteningInit(uint16_t whit_init){
  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_WHIT_INIT, whit_init);
}

/**
* @brief  Set the type of coding and decoding for the packets.
* @param  cCoding coding/decoding selection.
* @retval None.
*/
__STATIC_INLINE void LL_MRSubG_PacketHandlerCoding(MRSubG_PcktCoding cCoding){
  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_CODING_SEL, cCoding);
}

/**
* @brief  Set the Manchester type for the packets.
* @param  manType the Manchester encoding polarity.
*	0: '0' is encoded with '01' and '1' is encoded with '10'
*	1: '0' is encoded with '10' and '1' is encoded with '01'
* @retval None.
*/
__STATIC_INLINE void LL_MRSubG_PacketHandlerManchesterType(MRSubG_ManchesterPolarity manType){
  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CTRL, MR_SUBG_GLOB_STATIC_PCKT_CTRL_MANCHESTER_TYPE, manType);
}

/**
* @brief  Set the CRC mode.
* @param  xPktCrcMode This parameter can be one among the @ref MRSubG_PcktCrcMode .
* @retval None.
*/
__STATIC_INLINE void LL_MRSubG_PacketHandlerSetCrcMode(MRSubG_PcktCrcMode xPktCrcMode){
  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_CRC_MODE, xPktCrcMode);
}

/**
* @brief  Get the CRC mode.
* @retval MRSubG_PcktCrcMode CRC mode in the @ref MRSubG_PcktCrcMode enum.
*/
__STATIC_INLINE MRSubG_PcktCrcMode LL_MRSubG_PacketHandlerGetCrcMode(void){
  return (MRSubG_PcktCrcMode)(READ_REG(MR_SUBG_GLOB_STATIC->PCKT_CONFIG) & MR_SUBG_GLOB_STATIC_PCKT_CONFIG_CRC_MODE);
}

/**
 * @brief  Set the PCKTLEN field of the PCKTLEN_CONFIG register.
 * @param  nPacketLen payload length in bytes.
 * @retval None.
 */
__STATIC_INLINE void LL_MRSUBG_SetPacketLength(uint16_t nPacketLen){
  MODIFY_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->PCKTLEN_CONFIG, MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN, nPacketLen);
}

/**
 * @brief  Get the PCKTLEN field of the PCKTLEN_CONFIG register.
 * @retval Payload length in bytes.
 */
__STATIC_INLINE uint16_t LL_MRSUBG_GetPacketLength(void){
  return READ_REG(MR_SUBG_GLOB_DYNAMIC->PCKTLEN_CONFIG) & MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN;
}

/**
 * @brief  Set the FIX_VAR_LEN field of the PCKT_CONFI register.
 * @param  lenType length mode.
 *		0: FIXED length mode (no LENGTH field added in the frame in TX and no decode in RX)
 *		1: VARIABLE length mode (LENGTH field put in the frame in TX and decoded in RX)
 * @retval None.
 */
__STATIC_INLINE void LL_MRSUBG_SetFixedVariableLength(MRSubG_LengthMode lenType){
  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_FIX_VAR_LEN, lenType);
}

/**
 * @brief  Get the FIX_VAR_LEN field of the PCKT_CONFI register.
 * @retval The Fixed/Variable length mode.
 */
__STATIC_INLINE MRSubG_LengthMode LL_MRSUBG_GetFixedVariableLength(void){
  return (MRSubG_LengthMode)(READ_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_FIX_VAR_LEN));
}

/**
 * @brief  Return the payload length for the Basic packet format.
 * @retval Payload length in bytes.
 */
__STATIC_INLINE uint16_t LL_MRSubG_PktBasicGetPayloadLength(void){
 return READ_REG(MR_SUBG_GLOB_STATIC->DATABUFFER_SIZE) & MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE;
}

/**
 * @brief  Indicates if the LENGTH field is defined on 1 byte or 2 bytes.
 * @param  lenWidth the length field to set.
 * @retval None.
 */
__STATIC_INLINE void LL_MRSubG_SetLenWidth(MRSubG_LenWidthhMode lenWidth){
  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_LEN_WIDTH, lenWidth);
}

/**
 * @brief  Return the LENGTH field, defined on 1 byte or 2 bytes.
 * @retval The LENGTH field.
 */
__STATIC_INLINE MRSubG_LenWidthhMode LL_MRSubG_GetLenWidth(void){
  return (MRSubG_LenWidthhMode)(READ_REG_FIELD(MR_SUBG_GLOB_STATIC->PCKT_CONFIG, MR_SUBG_GLOB_STATIC_PCKT_CONFIG_LEN_WIDTH));
}

/**
 * @brief  Enable or Disable RX_TIMER_RX_CS_TIMEOUT flag.
 * @param  xNewState new state for RX_TIMER_RX_CS_TIMEOUT flag.
 *         This parameter can be ENABLE or DISABLE.
 * @retval None.
 */
__STATIC_INLINE void LL_MRSubG_SetRxCsTimeout(FunctionalState xNewState){
  if(xNewState == ENABLE)
    SET_BIT(MR_SUBG_GLOB_DYNAMIC->RX_TIMER, MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_CS_TIMEOUT_MASK);
  else
    CLEAR_BIT(MR_SUBG_GLOB_DYNAMIC->RX_TIMER, MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_CS_TIMEOUT_MASK);
}

/**
 * @brief  Enable or Disable RX_TIMER_RX_PQI_TIMEOUT flag.
 * @param  xNewState new state for RX_TIMER_RX_PQI_TIMEOUT flag.
 *         This parameter can be ENABLE or DISABLE.
 * @retval None.
 */
__STATIC_INLINE void LL_MRSubG_SetRxPqiTimeout(FunctionalState xNewState){
  if(xNewState == ENABLE)
    SET_BIT(MR_SUBG_GLOB_DYNAMIC->RX_TIMER, MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_PQI_TIMEOUT_MASK);
  else
    CLEAR_BIT(MR_SUBG_GLOB_DYNAMIC->RX_TIMER, MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_PQI_TIMEOUT_MASK);
}

/**
 * @brief  Enable or Disable RX_TIMER_RX_SQI_TIMEOUT flag.
 * @param  xNewState new state for RX_TIMER_RX_SQI_TIMEOUT flag.
 *         This parameter can be ENABLE or DISABLE.
 * @retval None.
 */
__STATIC_INLINE void LL_MRSubG_SetRxSqiTimeout(FunctionalState xNewState){
  if(xNewState == ENABLE)
    SET_BIT(MR_SUBG_GLOB_DYNAMIC->RX_TIMER, MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_SQI_TIMEOUT_MASK);
  else
    CLEAR_BIT(MR_SUBG_GLOB_DYNAMIC->RX_TIMER, MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_SQI_TIMEOUT_MASK);
}

/**
 * @brief  Set or Reset RX_TIMER_RX_OR_nAND_SELECT.
 * @param  xNewState new state for RX_TIMER_RX_OR_nAND_SELECT bit.
 *         This parameter can be SET or RESET.
 * @retval None.
 */
__STATIC_INLINE void LL_MRSubG_SetRxOrnAndSelect(FlagStatus xNewState){
  if(xNewState == SET)
    SET_BIT(MR_SUBG_GLOB_DYNAMIC->RX_TIMER, MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_OR_nAND_SELECT);
  else
    CLEAR_BIT(MR_SUBG_GLOB_DYNAMIC->RX_TIMER, MR_SUBG_GLOB_DYNAMIC_RX_TIMER_RX_OR_nAND_SELECT);
}

/**
 * @brief  Enable or Disable FAST_CS_TERM.
 * @param  xNewState new state for FAST_CS_TERM_EN.
 *         This parameter can be S_ENABLE or S_DISABLE.
 * @retval None.
 */
__STATIC_INLINE void LL_MRSubG_FastCsTermEn(FunctionalState xNewState){
  if(xNewState == ENABLE)
    SET_BIT(MR_SUBG_GLOB_DYNAMIC->FAST_RX_TIMER, MR_SUBG_GLOB_DYNAMIC_FAST_RX_TIMER_FAST_CS_TERM_EN);
  else
    CLEAR_BIT(MR_SUBG_GLOB_DYNAMIC->FAST_RX_TIMER, MR_SUBG_GLOB_DYNAMIC_FAST_RX_TIMER_FAST_CS_TERM_EN);
}

