stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_mrsubg.h
/**
 * @brief  Set or Reset VCO_CALIB_REQ.
 * @param  xNewState new state for VCO_CALIB_REQ bit.
 *         This parameter can be SET or RESET.
 * @retval None.
 */
__STATIC_INLINE void LL_MRSubG_VCOCalibReq(FlagStatus xNewState){
  if(xNewState == SET)
    SET_BIT(MR_SUBG_GLOB_DYNAMIC->VCO_CAL_CONFIG, MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALIB_REQ);
  else
    CLEAR_BIT(MR_SUBG_GLOB_DYNAMIC->VCO_CAL_CONFIG, MR_SUBG_GLOB_DYNAMIC_VCO_CAL_CONFIG_VCO_CALIB_REQ);
}

/**
 * @brief  Return the CHFLT_E field.
 * @retval The CHFLT_E field.
 */
__STATIC_INLINE uint8_t LL_MRSubG_GetChFlt_E(void){
  return READ_REG_FIELD(MR_SUBG_GLOB_DYNAMIC->MOD1_CONFIG, MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_E);
}

/**
 * @brief  Return the RSSI_LEVEL_ON_SYNC register.
 * @retval The RSSI Level On Sync value.
 */
__STATIC_INLINE uint16_t LL_MRSubG_GetRssiLevelOnSync(void){
  return READ_REG(MR_SUBG_GLOB_STATUS->RX_INDICATOR) & MR_SUBG_GLOB_STATUS_RX_INDICATOR_RSSI_LEVEL_ON_SYNC;
}

/**
 * @brief  Set the MRSUBG RSSI_FLT register.
 * @retval The value to store for the register.
 */
__STATIC_INLINE void LL_MRSubG_SetRSSIFilter(uint32_t rssiFilter){
  WRITE_REG(MR_SUBG_RADIO->RSSI_FLT, rssiFilter);
}

/**
 * @brief  Set the RSSI threshold register.
 * @retval The value to store for the signal detect threshold.
 */
__STATIC_INLINE void LL_MRSubG_SetRssiThresholdRegister(uint16_t rssiValReg){
  MODIFY_REG_FIELD(MR_SUBG_GLOB_STATIC->AS_QI_CTRL, MR_SUBG_GLOB_STATIC_AS_QI_CTRL_RSSI_THR, rssiValReg);
}

/**
 * @brief  Set the MRSUBG Clock Recovery 0 register.
 * @retval The value to store for the register.
 */
__STATIC_INLINE void LL_MRSubG_SetClkRecCtrl0(uint32_t clkRec){
  WRITE_REG(MR_SUBG_RADIO->CLKREC_CTRL0, clkRec);
}

/**
 * @brief  Set the MRSUBG Clock Recovery 1 register.
 * @retval The value to store for the register.
 */
__STATIC_INLINE void LL_MRSubG_SetClkRecCtrl1(uint32_t clkRec){
  WRITE_REG(MR_SUBG_RADIO->CLKREC_CTRL1, clkRec);
}

/**
 * @brief  Set the MRSUBG AFC0 register.
 * @retval The value to store for the AFC0_CONFIG register.
 */
__STATIC_INLINE void LL_MRSubG_SetAFC0(uint32_t afcCfg){
  WRITE_REG(MR_SUBG_RADIO->AFC0_CONFIG, afcCfg);
}

/**
 * @brief  Set the MRSUBG AFC1 register.
 * @retval The value to store for the AFC1_CONFIG register.
 */
__STATIC_INLINE void LL_MRSubG_SetAFC1(uint32_t afcCfg){
  WRITE_REG(MR_SUBG_RADIO->AFC1_CONFIG, afcCfg);
}

/**
 * @brief  Set the MRSUBG AFC2 register.
 * @retval The value to store for the AFC2_CONFIG register.
 */
__STATIC_INLINE void LL_MRSubG_SetAFC2(uint32_t afcCfg){
  WRITE_REG(MR_SUBG_RADIO->AFC2_CONFIG, afcCfg);
}

/**
 * @brief  Set the MRSUBG AFC3 register.
 * @retval The value to store for the AFC3_CONFIG register.
 */
__STATIC_INLINE void LL_MRSubG_SetAFC3(uint32_t afcCfg){
  WRITE_REG(MR_SUBG_RADIO->AFC3_CONFIG, afcCfg);
}

/**
 @verbatim
  ==============================================================================
                     ##### How to use the MRSUBG Radio Sequencer #####
  ==============================================================================
    [..]
    The LL_SEQUENCER driver contains a set of APIs that can be used to configure
    the STM32WL3 MRSubG sequencer hardware.
    Typically it is used as follows:

  *** Step 1: Set up ActionConfiguration tables ***
  =================================================
    [..]
    In this step, configuration RAM tables are created for all actions in the
    flow graph.

   (+) Allocate a MRSubG_Sequencer_ActionConfiguration struct for each action
       that is part of your flow graph. The sequencer hardware accesses this
       struct in RAM as the ActionConfiguration RAM table.
       It must persist in RAM while the Action is being executed.
       Make sure that the RAM table is word-aligned.

   (+) For each ActionConfiguration item:

       (++) Set up the dynamic registers (MR_SUBG_GLOB_DYNAMIC) of the STM32WL3
            as desired upon execution of the action. This can be performed
            using the standard MRSubG_* and packet APIs.
            Do not issue any command in the meantime (i.e., keep COMMAND_ID in
            the COMMAND to 0) to prevent side effects.
       (++) Copy all dynamic register values to the ActionConfiguration RAM
            table using MRSubG_Sequencer_ApplyDynamicConfig and configure
            which command is issued when the action gets executed.
       (++) Change the appropriate values in the
            MRSubG_Sequencer_ActionConfiguration struct to configure under
            which conditions either NextAction1 or NextAction2 are executed,
            to provide a pointer to ActionConfiguration RAM tables for both
            actions and to configure inter-action intervals.
            Use SEQ_MASK_NEVER_MATCH as NextAction1Mask / NextAction2Mask to
            ensure that this particular next action is never executed.
       (++) You may choose to configure an ActionTimeout, i.e. limit the
            maximum time to wait for a mask match for either NextAction1 or
            NextAction2.

  *** Step 2: Set up GlobalConfiguration table ***
  ================================================
    [..]
    In this step, a single configuration RAM table containing the global
    sequencer properties and the contents of the static configuration
    registers is created.

   (+) Allocate a MRSubG_Sequencer_GlobalConfiguration struct.
       The sequencer hardware accesses this struct in RAM as the
       GlobalConfiguration RAM table. The sequencer hardware will update
       properties of this RAM table during operation.

   (+) Modify the GlobalConfiguration struct:

       (++) Set up the static registers (MR_SUBG_GLOB_STATIC) of the STM32WL3
            as desired upon execution of the action. This can be performed
            using the standard MRSubG_* and packet APIs.
       (++) Copy all static register values to the GlobalConfiguration RAM
            table using MRSubG_Sequencer_ApplyStaticConfig.
       (++) Set the current (i.e., first) action to execute by making
            ActionConfigPtr point to the appropriate ActionConfiguration.

   (+) Tell the sequencer hardware where to find the GlobalConfiguration
       by calling LL_MRSubG_Sequencer_SetGlobalConfiguration.

