stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_mrsubg.h
  *** Step 3: Trigger the sequencer ***
  =====================================
    [..]
   (+) When desired, start the sequencer using MRSubG_Sequencer_Trigger.

   (+) You may choose to intervene into the sequencer control flow
       programmatically using, for example, an interrupt.

   (+) If, at any point, you need to restart the sequencer:

       (++) Set the action to execute next by modifying ActionConfigPtr in
            the GlobalConfiguration struct.
       (++) Re-trigger the sequencer using MRSubG_Sequencer_Trigger.
  @endverbatim
**/

/*
 * @brief  Set global configuration table for sequencer hardware.
 * @param  Pointer to the global configuration table struct.
 * @retval None
 */
__STATIC_INLINE void LL_MRSubG_Sequencer_SetGlobalConfiguration(MRSubG_Sequencer_GlobalConfiguration *cfg){
  /* GLOBALTABLE_PTR is relative to device SRAM base address */
  MR_SUBG_GLOB_RETAINED->SEQ_GLOBALTABLE_PTR = ((uint32_t)cfg) - SRAM_BASE;
}

/*
 * @brief  Determine whether sequencer hardware is currently active.
 * @retval 1 in case sequencer is active, otherwise 0
 */
__STATIC_INLINE uint8_t LL_MRSubG_Sequencer_IsActive(void){
  return (MR_SUBG_GLOB_MISC->SEQUENCER_CTRL & MR_SUBG_GLOB_MISC_SEQUENCER_CTRL_DISABLE_SEQ) ? 0 : 1;
}

/*
 * @brief  Trigger sequencer, i.e., launch sequence of actions.
 * @retval None
 */
__STATIC_INLINE void LL_MRSubG_Sequencer_Trigger(void){
  MR_SUBG_GLOB_MISC->SEQUENCER_CTRL &= ~MR_SUBG_GLOB_MISC_SEQUENCER_CTRL_DISABLE_SEQ;
  MR_SUBG_GLOB_MISC->SEQUENCER_CTRL |= MR_SUBG_GLOB_MISC_SEQUENCER_CTRL_GEN_SEQ_TRIGGER;
}

/*
 * @brief  Disable sequencer hardware.
 * @retval None
 */
__STATIC_INLINE void LL_MRSubG_Sequencer_Disable(void){
  MR_SUBG_GLOB_MISC->SEQUENCER_CTRL |= MR_SUBG_GLOB_MISC_SEQUENCER_CTRL_DISABLE_SEQ | MR_SUBG_GLOB_MISC_SEQUENCER_CTRL_GEN_SEQ_TRIGGER;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /*STM32WL3x_LL_MRSUBG_H */
